insert dbo.subject(PLACE,SJNAME,SINTRO)
values ('车管所安排考场',1,'科目一,考试形式为上机考试,100道题,90分及以上过关。'),
('训练场',2,'科目二,考试项目包括倒车入库,坡道定点停车起步,直角转弯,曲线行驶。'),
('马路',3,'科目三,主要考察上车准备,灯光模拟考试,起步,行驶,加减挡位操作等技能。'),
('车管所安排考场',4,'科目四,安全文明驾驶,复杂条件下驾驶技能,紧急情况处置等。')

---修理，加油，保养，购买，其他
insert dbo.e_kind(EKNO,ENAME,EINTRO)
values ('ekind001','修理','汽车修理所产生的消费'),
('ekind002','加油','汽车加油所产生的消费'),
('ekind003','保养','洗车，换零件之类的保养活动所产生的费用'),
('ekind004','购买','购买车辆所花的费用'),
('ekind005','其他','待填写')

---学费，考试费，重修缴费

insert dbo.i_kind(IKNO,INAME,IINTRO)
values ('ikind001','考试','学生考试缴纳的费用'),
('ikind002','入学费','学生入学所缴纳的费用'),
('ikind003','重修费','学生重修所缴纳的费用'),
('ikind004','购买','购买车辆所花的费用'),
('ikind005','其他','待填写')

---教练
insert dbo.coach(CNO,CNAME,PHONE,SEX)
values ('JL000001','秦教练','15112124343','男'),
('JL000002','刘教练','15012124343','女'),
('JL000003','李教练','15212124343','男')

---学员
insert dbo.student(SNO,SNAME,SEX,PHONE,PAY,PROGRESS)
values ('XY000001','张三','男','133111122222',1,1),
('XY000002','李四','男','133222223333',1,5),
('XY000003','王五','女','133443341244',1,3),
('XY000004','赵六','女','131111426222',1,2),
('XY000005','侯七','男','133117777722',0,1),
('XY000006','朱八','男','131513377222',1,1)

---车辆

insert dbo.car(LIC,COLOR,BRAND,BUYTIME,MILE)
values ('苏A01001','黄','一汽大众',2001-1-1,10000),
('苏A01002','白','宝马',2005-1-1,10000),
('苏A01003','白','奥迪',2004-1-1,10000),
('苏A01004','黑','五菱宏光',2008-1-1,10000)

---考试

insert dbo.exam(SJNAME,SNO,GRADE,DATE)
values (1,'XY0000002',99,2009-10-1),
(2,'XY0000002',99,2009-11-2),
(3,'XY0000002',50,2010-1-3),
(4,'XY0000002',99,2010-1-7),
(3,'XY0000002',99,2010-1-5),
(1,'XY0000003',99,2009-10-1),
(2,'XY0000003',90,2009-11-1),
(1,'XY0000004',33,2009-10-1),
(1,'XY0000004',55,2009-11-1),
(1,'XY0000004',90,2009-12-1),

---学生教练



---教练车辆


---收入


---支出


